In [4]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from pandas import Series,DataFrame

In [5]:
ds=pd.read_csv("D:/Data Science/Bangalore House Price Prediction/bengaluru_house_prices.csv")
ds.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [6]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [7]:
ds.isna().sum().sum()

6201

In [8]:
ds.isna().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [9]:
ds=ds.drop("society",axis=1)

In [10]:
ds.isna().sum().sum()

699

In [71]:
ds['bath'].median()

2.0

In [11]:
ds['bath'] = ds['bath'].replace(np.NaN, ds['bath'].median())

In [12]:
ds.isnull().sum()

area_type         0
availability      0
location          1
size             16
total_sqft        0
bath              0
balcony         609
price             0
dtype: int64

In [13]:
ds['balcony'].median()

2.0

In [14]:
ds['balcony'] = ds['balcony'].replace(np.NaN, ds['balcony'].median())

In [15]:
ds.isna().sum().sum()

17

In [16]:
ds = ds.dropna()

In [17]:
ds.shape

(13303, 8)

In [18]:
ds['bhk']=ds['size'].str.split().str.get(0).astype(int)

In [72]:
ds.head()

,area_type,location,total_sqft,bath,balcony,price,bhk
0,Super built-up Area,1st Block Jayanagar,2850.0,4.0,1.0,428.0,4
1,Super built-up Area,1st Block Jayanagar,1630.0,3.0,2.0,194.0,3
2,Super built-up Area,1st Block Jayanagar,1875.0,2.0,3.0,235.0,3
3,Built-up Area,1st Block Jayanagar,1200.0,2.0,0.0,130.0,3
4,Super built-up Area,1st Block Jayanagar,1235.0,2.0,2.0,148.0,2

In [19]:
ds[ds.bhk>20]

,area_type,availability,location,size,total_sqft,bath,balcony,price,bhk
1718,Super built-up Area,Ready To Move,2Electronic City Phase II,27 BHK,8000,27.0,0.0,230.0,27
4684,Plot Area,Ready To Move,Munnekollal,43 Bedroom,2400,40.0,0.0,660.0,43

In [20]:
ds['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [21]:
def convertRange(x):
  temp = x.split('-')
  if len(temp)==2:
    return (float(temp[0]+float(temp[1])))/2
  try:
    return float(x)
  except:
    return None

In [22]:
ds['total_sqft'] = pd.to_numeric(ds['total_sqft'],errors='coerce')

In [23]:
ds.isna().sum().sum()

239

In [24]:
ds = ds.dropna()

In [25]:
ds.shape

(13064, 9)

In [26]:
ds['price_per_sqft']=ds['price']*100000/ds['total_sqft']

In [27]:
ds.head()

,area_type,availability,location,size,total_sqft,bath,balcony,price,bhk,price_per_sqft
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,1056.0,2.0,1.0,39.07,2,3699.810606
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,2600.0,5.0,3.0,120.00,4,4615.384615
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,1440.0,2.0,3.0,62.00,3,4305.555556
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,1521.0,3.0,1.0,95.00,3,6245.890861
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,1200.0,2.0,1.0,51.00,2,4250.000000

In [28]:
ds['location']=ds['location'].apply(lambda x: x.strip())

In [29]:
location_count=ds['location'].value_counts()
location_count

Whitefield                   518
Sarjapur  Road               387
Electronic City              304
Kanakpura Road               264
Thanisandra                  225
                            ...
Lakshmipura Vidyaanyapura      1
Malur Hosur Road               1
Subramanyanagar                1
1 Ramamurthy Nagar             1
Abshot Layout                  1
Name: location, Length: 1287, dtype: int64

In [30]:
location_count_less_than_10=location_count[location_count<=10]

In [31]:
location_count_less_than_10

Sadashiva Nagar              10
Naganathapura                10
ITPL                         10
Nagappa Reddy Layout         10
Sector 1 HSR Layout          10
                             ..
Lakshmipura Vidyaanyapura     1
Malur Hosur Road              1
Subramanyanagar               1
1 Ramamurthy Nagar            1
Abshot Layout                 1
Name: location, Length: 1048, dtype: int64

In [32]:
ds['location']=ds['location'].apply(lambda x: 'Other' if x in location_count_less_than_10 else x)

In [33]:
ds['location'].value_counts()

Other                        2878
Whitefield                    518
Sarjapur  Road                387
Electronic City               304
Kanakpura Road                264
                             ...
Banjara Layout                 11
Marsur                         11
Pattandur Agrahara             11
Nehru Nagar                    11
2nd Phase Judicial Layout      11
Name: location, Length: 240, dtype: int64

In [34]:
(ds['total_sqft']/ds['bhk']).describe()

count    13064.000000
mean       572.935339
std        389.555892
min          0.250000
25%        471.916667
50%        551.000000
75%        625.000000
max      26136.000000
dtype: float64

In [35]:
ds = ds[((ds['total_sqft']/ds['bhk'])>=300)]
#ds = ds[((ds['total_sqft']/ds['bhk'])>=100)]

In [36]:
#uv=np.percentile(ds.price_per_sqft, [99.75])[0]
#uv

30048.99193548417

In [37]:
ds['price_per_sqft'].describe()

count     12320.000000
mean       6323.432530
std        4186.147377
min         267.829813
25%        4209.344773
50%        5300.000000
75%        6938.556538
max      176470.588235
Name: price_per_sqft, dtype: float64

In [38]:
def remove_outliers_sqft(ds):
    df_output=pd.DataFrame()
    for key,subdf in ds.groupby('location'):
        m=np.mean(subdf.price_per_sqft)
        st=np.std(subdf.price_per_sqft)
        gen_df=subdf[(subdf.price_per_sqft>(m-st)) & (subdf.price_per_sqft<=(m+st))]
        df_output=pd.concat([df_output,gen_df],ignore_index=True)
    return df_output
ds=remove_outliers_sqft(ds)
ds.describe()

,total_sqft,bath,balcony,price,bhk,price_per_sqft
count,10151.000000,10151.000000,10151.000000,10151.000000,10151.000000,10151.000000
mean,1502.361208,2.472269,1.623781,91.065706,2.574032,5668.883762
std,873.664454,0.972628,0.773210,86.190075,0.894764,2274.029160
min,300.000000,1.000000,0.000000,10.000000,1.000000,1250.000000
25%,1110.000000,2.000000,1.000000,49.000000,2.000000,4242.424242
50%,1282.000000,2.000000,2.000000,67.000000,2.000000,5183.823529
75%,1650.000000,3.000000,2.000000,100.000000,3.000000,6445.733088
max,30400.000000,16.000000,3.000000,2200.000000,16.000000,24509.803922

In [39]:
def bhk_outlier_remover(df):
    exclude_indices=np.array([])
    for location,location_df in df.groupby('location'):
        bhk_stats={}
        for bhk,bhk_df in location_df.groupby('bhk'):
            bhk_stats[bhk]={
                'mean':np.mean(bhk_df.price_per_sqft),
                'std':np.std(bhk_df.price_per_sqft),
                'count':bhk_df.shape[0]
            } 
        for bhk,bhk_df in location_df.groupby('bhk'):
            stats=bhk_stats.get(bhk-1)
            if stats and stats['count']>5:
                exclude_indices=np.append(exclude_indices,bhk_df[bhk_df.price_per_sqft<(stats['mean'])].index.values)
    return df.drop(exclude_indices,axis='index')

In [40]:
ds=bhk_outlier_remover(ds)

In [41]:
ds.shape

(7211, 10)

In [42]:
ds.drop(columns=['availability'], inplace=True)

In [43]:
ds.drop(columns=['price_per_sqft', 'size'], inplace=True)

In [44]:
ds.head()

,area_type,location,total_sqft,bath,balcony,price,bhk
0,Super built-up Area,1st Block Jayanagar,2850.0,4.0,1.0,428.0,4
1,Super built-up Area,1st Block Jayanagar,1630.0,3.0,2.0,194.0,3
2,Super built-up Area,1st Block Jayanagar,1875.0,2.0,3.0,235.0,3
3,Built-up Area,1st Block Jayanagar,1200.0,2.0,0.0,130.0,3
4,Super built-up Area,1st Block Jayanagar,1235.0,2.0,2.0,148.0,2

In [45]:
ds.to_csv("minor_cleaned_01.csv")

In [46]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression, Lasso, Ridge
from sklearn.preprocessing import OneHotEncoder, StandardScaler
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline
from sklearn.metrics import r2_score

In [47]:
X=ds.drop(columns=['price'])
y=ds['price']

In [48]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=0)

In [49]:
print(X_train.shape)
print(y_test.shape)
print(X_test.shape)
print(y_train.shape)

(5768, 6)
(1443,)
(1443, 6)
(5768,)

In [50]:
cols_to_trans=['location', 'area_type']

In [51]:
column_trans=make_column_transformer((OneHotEncoder(sparse=False), cols_to_trans), remainder='passthrough')

In [52]:
#Linear Regression

In [62]:
scaler=StandardScaler()
lr=LinearRegression(normalize=True)
pipe_lr=make_pipeline(column_trans, scaler, lr)
pipe_lr.fit(X_train,y_train)
y_pred_lr=pipe_lr.predict(X_test)
r2_score(y_test, y_pred_lr)

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\linear_model\_base.py:141: FutureWarning: 'normalize' was deprecated in version 1.0 and will be removed in 1.2.
If you wish to scale the data, use Pipeline with a StandardScaler in a preprocessing stage. To reproduce the previous behavior:

from sklearn.pipeline import make_pipeline

model = make_pipeline(StandardScaler(with_mean=False), LinearRegression())

If you wish to pass a sample_weight parameter, you need to pass it as a fit parameter to each step of the pipeline as follows:

kwargs = {s[0] + '__sample_weight': sample_weight for s in model.steps}
model.fit(X, y, **kwargs)


  warnings.warn(

0.8738422890557143

In [54]:
#Lasso

In [63]:
lasso=Lasso()
pipe_lasso=make_pipeline(column_trans, scaler, lasso)
pipe_lasso.fit(X_train,y_train)
y_pred_lasso=pipe_lasso.predict(X_test)
r2_score(y_test, y_pred_lasso)

0.8601837871433106

In [56]:
#Ridge

In [64]:
ridge=Ridge()
pipe_ridge=make_pipeline(column_trans, scaler, ridge)
pipe_ridge.fit(X_train,y_train)
y_pred_ridge=pipe_ridge.predict(X_test)
r2_score(y_test, y_pred_ridge)

0.873723259598424

In [65]:
ds.head()

,area_type,location,total_sqft,bath,balcony,price,bhk
0,Super built-up Area,1st Block Jayanagar,2850.0,4.0,1.0,428.0,4
1,Super built-up Area,1st Block Jayanagar,1630.0,3.0,2.0,194.0,3
2,Super built-up Area,1st Block Jayanagar,1875.0,2.0,3.0,235.0,3
3,Built-up Area,1st Block Jayanagar,1200.0,2.0,0.0,130.0,3
4,Super built-up Area,1st Block Jayanagar,1235.0,2.0,2.0,148.0,2

In [66]:
ds.corr()

            total_sqft      bath   balcony     price       bhk
total_sqft    1.000000  0.707664  0.255400  0.840305  0.672873
bath          0.707664  1.000000  0.282182  0.610582  0.879820
balcony       0.255400  0.282182  1.000000  0.205609  0.269069
price         0.840305  0.610582  0.205609  1.000000  0.567418
bhk           0.672873  0.879820  0.269069  0.567418  1.000000

In [67]:
import pickle

In [70]:
pickle.dump(pipe_lr, open("LinearRegression.pkl", 'wb'))

In [74]:
pickle.dump(pipe_lasso, open("Lasso.pkl", 'wb'))

In [75]:
pickle.dump(pipe_ridge, open("Ridge.pkl", 'wb'))